#### Terraform Initialization ⚙️`success`
#### Terraform Apply 📖`success`

<details><summary>Show Apply</summary>

```terraform
[0m[1maws_ssm_parameter.discord_id: Refreshing state... [id=discordMusicLinkConverter-Bot-target-ID][0m
[0m[1mdata.aws_iam_policy_document.task_role: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.execution: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.task_role_doc: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.task_role: Read complete after 0s [id=320642683][0m
[0m[1mdata.aws_iam_policy_document.execution: Read complete after 0s [id=2149001579][0m
[0m[1mdata.aws_iam_policy_document.task_role_doc: Read complete after 0s [id=1630442276][0m
[0m[1maws_iam_policy.task_execution: Refreshing state... [id=arn:aws:iam::526378883024:policy/discordMusicLinkConverter-TaskExecution][0m
[0m[1maws_iam_role.bot_task_execution_role: Refreshing state... [id=discordMusicLinkConverter-TaskExecutionRole][0m
[0m[1maws_iam_role.bot_task_role: Refreshing state... [id=discordMusicLinkConverter-TaskRole][0m
[0m[1maws_iam_policy.task_policy: Refreshing state... [id=arn:aws:iam::526378883024:policy/discordMusicLinkConverter-TaskPolicy][0m
[0m[1maws_iam_role_policy_attachment.bot_task_execution: Refreshing state... [id=discordMusicLinkConverter-TaskExecutionRole-20220601194846889100000001][0m
[0m[1maws_iam_role_policy_attachment.bot_task: Refreshing state... [id=discordMusicLinkConverter-TaskRole-20220601194846894500000002][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_ssm_parameter.discord_token[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ssm_parameter" "discord_token" {
      [32m+[0m [0m[1m[0marn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdata_type[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mkey_id[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m      = "discordMusicLinkConverter-Bot-Token"
      [32m+[0m [0m[1m[0mtags_all[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mtier[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m      = "SecureString"
      [32m+[0m [0m[1m[0mvalue[0m[0m     = (sensitive value)
      [32m+[0m [0m[1m[0mversion[0m[0m   = (known after apply)
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[0m[1maws_ssm_parameter.discord_token: Creating...[0m[0m
[0m[1maws_ssm_parameter.discord_token: Creation complete after 1s [id=discordMusicLinkConverter-Bot-Token][0m
[0m[1m[32m
Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
[0m```

</details>

*Pusher: @scarlet0725, Action: `pull_request`, Workflow: `Deploy`*